  ### Deployment Results ✅

  **jcetina** successfully **noop** deployed branch `jcetina/add-nat-gw` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/0a8965dd-7c8e-4280-836f-dfcb989bc30f/terraform-bin plan -no-color -compact-warnings

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

# module.server_subnet.azurerm_subnet.subnet has been deleted
- resource "azurerm_subnet" "subnet" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/ServerSubnet" -> null
      name                                           = "ServerSubnet"
      # (7 unchanged attributes hidden)
  }

# module.vnet.azurerm_virtual_network.vnet has been deleted
- resource "azurerm_virtual_network" "vnet" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet" -> null
    - location                = "eastus" -> null
    - name                    = "my-secure-vnet" -> null
    - resource_group_name     = "org-jcetina-repo-baklava-rg" -> null
      tags                    = {}
      # (5 unchanged attributes hidden)
  }

# module.vnet.module.firewall.azurerm_firewall.firewall has been deleted
- resource "azurerm_firewall" "firewall" {
    - id                  = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/azureFirewalls/my-secure-firewall" -> null
      name                = "my-secure-firewall"
      tags                = {}
      # (8 unchanged attributes hidden)

    ~ ip_configuration {
          name                 = "my-secure-firewall-ip-config"
        - private_ip_address   = "10.0.0.4" -> null
          # (2 unchanged attributes hidden)
      }
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway has been deleted
- resource "azurerm_nat_gateway" "nat_gateway" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/natGateways/my-secure-nat-gw" -> null
      name                    = "my-secure-nat-gw"
      tags                    = {}
      # (6 unchanged attributes hidden)
  }

# module.vnet.module.route_table.azurerm_route_table.route_table has been deleted
- resource "azurerm_route_table" "route_table" {
    - id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/routeTables/my-secure-route-table" -> null
      name                          = "my-secure-route-table"
      # (5 unchanged attributes hidden)
  }

# module.vnet.module.subnet.azurerm_subnet.subnet has been deleted
- resource "azurerm_subnet" "subnet" {
    - id                                             = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet" -> null
      name                                           = "AzureFirewallSubnet"
      # (7 unchanged attributes hidden)
  }

# module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-firewall-ip" -> null
    - ip_address              = "20.231.201.35" -> null
      name                    = "my-secure-firewall-ip"
      tags                    = {}
      # (9 unchanged attributes hidden)
  }

# module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip has been deleted
- resource "azurerm_public_ip" "public_ip" {
    - id                      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-nat-gw-public-ip-1" -> null
    - ip_address              = "20.121.198.166" -> null
      name                    = "my-secure-nat-gw-public-ip-1"
      tags                    = {}
      # (9 unchanged attributes hidden)
  }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# azurerm_linux_virtual_machine.examserverple will be created
+ resource "azurerm_linux_virtual_machine" "examserverple" {
    + admin_username                  = "adminuser"
    + allow_extension_operations      = true
    + computer_name                   = (known after apply)
    + disable_password_authentication = true
    + extensions_time_budget          = "PT1H30M"
    + id                              = (known after apply)
    + location                        = "eastus"
    + max_bid_price                   = -1
    + name                            = "server"
    + network_interface_ids           = (known after apply)
    + patch_mode                      = "ImageDefault"
    + platform_fault_domain           = -1
    + priority                        = "Regular"
    + private_ip_address              = (known after apply)
    + private_ip_addresses            = (known after apply)
    + provision_vm_agent              = true
    + public_ip_address               = (known after apply)
    + public_ip_addresses             = (known after apply)
    + resource_group_name             = "org-jcetina-repo-baklava-rg"
    + size                            = "Standard_F2"
    + virtual_machine_id              = (known after apply)

    + admin_ssh_key {
        + public_key = <<-EOT
              ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDAL5gepLTmUuvBvGN+PwrdliXVyU0UKUz0CBYrdQWg6fPF8TAmQ/lrLZzaxopzHYFU5rDyK8ZtL1TzLEEtyGboWizmotiQEQuLpS8hrpDJMwTbLnjiekaUpR1YfAL2Xo4ridCvKmoBquxnLgtWEnlPPUwU8IZ2WSp8ok9YzdsyoJik3NmhvaF9eunq8oOW6x6bfdlXDxt+OM4DAQphKOMDwUFAhi3DAc2SPDrssTVo2il/5K1zmZNLobjwRKp7kiFTzaPXdcRDCZ0w+jccv0o8KH01IACgCBvUgmU6Sv+BrsakPVsnKnA1C7uE/mOe9Ofyz2qv6nrsnXF+KdRIzqJlcJ2r++qQtRg8MTiNxJAQ5neo2JC+X35np2Lkc9nY5mejO19JhXh7sXnQYpaJfZnSHAli4teICgmgtFFOadQJ3IP03PHUPy668S/ToktZ5tJLX4+ISERUt87OYzZ0rrOLbXW9ia4VKlbkVOkUh3WcOBvgotFIB6IPRpAhnBl8GmE=
          EOT
        + username   = "adminuser"
      }

    + os_disk {
        + caching                   = "ReadWrite"
        + disk_size_gb              = (known after apply)
        + name                      = (known after apply)
        + storage_account_type      = "Standard_LRS"
        + write_accelerator_enabled = false
      }

    + source_image_reference {
        + offer     = "UbuntuServer"
        + publisher = "Canonical"
        + sku       = "20.04-LTS"
        + version   = "latest"
      }

    + termination_notification {
        + enabled = (known after apply)
        + timeout = (known after apply)
      }
  }

# azurerm_network_interface.server will be created
+ resource "azurerm_network_interface" "server" {
    + applied_dns_servers           = (known after apply)
    + dns_servers                   = (known after apply)
    + enable_accelerated_networking = false
    + enable_ip_forwarding          = false
    + id                            = (known after apply)
    + internal_dns_name_label       = (known after apply)
    + internal_domain_name_suffix   = (known after apply)
    + location                      = "eastus"
    + mac_address                   = (known after apply)
    + name                          = "server-nic"
    + private_ip_address            = (known after apply)
    + private_ip_addresses          = (known after apply)
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + virtual_machine_id            = (known after apply)

    + ip_configuration {
        + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
        + name                                               = "internal"
        + primary                                            = (known after apply)
        + private_ip_address                                 = (known after apply)
        + private_ip_address_allocation                      = "Dynamic"
        + private_ip_address_version                         = "IPv4"
        + subnet_id                                          = (known after apply)
      }
  }

# azurerm_subnet_route_table_association.server_subnet_association will be created
+ resource "azurerm_subnet_route_table_association" "server_subnet_association" {
    + id             = (known after apply)
    + route_table_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.server_subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.1.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "ServerSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.azurerm_firewall_policy.policy will be created
+ resource "azurerm_firewall_policy" "policy" {
    + child_policies           = (known after apply)
    + firewalls                = (known after apply)
    + id                       = (known after apply)
    + location                 = "eastus"
    + name                     = "my-secure-policy"
    + resource_group_name      = "org-jcetina-repo-baklava-rg"
    + rule_collection_groups   = (known after apply)
    + sku                      = (known after apply)
    + threat_intelligence_mode = "Alert"
  }

# module.vnet.azurerm_subnet_nat_gateway_association.firewall_association will be created
+ resource "azurerm_subnet_nat_gateway_association" "firewall_association" {
    + id             = (known after apply)
    + nat_gateway_id = (known after apply)
    + subnet_id      = (known after apply)
  }

# module.vnet.azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-vnet"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.vnet.module.firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + firewall_policy_id  = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)

    + ip_configuration {
        + name                 = "my-secure-firewall-ip-config"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = (known after apply)
        + subnet_id            = (known after apply)
      }
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway.nat_gateway will be created
+ resource "azurerm_nat_gateway" "nat_gateway" {
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + location                = "eastus"
    + name                    = "my-secure-nat-gw"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + resource_guid           = (known after apply)
    + sku_name                = "Standard"
  }

# module.vnet.module.nat_gateway.azurerm_nat_gateway_public_ip_association.association["1"] will be created
+ resource "azurerm_nat_gateway_public_ip_association" "association" {
    + id                   = (known after apply)
    + nat_gateway_id       = (known after apply)
    + public_ip_address_id = (known after apply)
  }

# module.vnet.module.route_table.azurerm_route_table.route_table will be created
+ resource "azurerm_route_table" "route_table" {
    + disable_bgp_route_propagation = false
    + id                            = (known after apply)
    + location                      = "eastus"
    + name                          = "my-secure-route-table"
    + resource_group_name           = "org-jcetina-repo-baklava-rg"
    + route                         = [
        + {
            + address_prefix         = "0.0.0.0/0"
            + name                   = "ToFirewall"
            + next_hop_in_ip_address = (known after apply)
            + next_hop_type          = "VirtualAppliance"
          },
        + {
            + address_prefix         = "10.0.0.0/16"
            + name                   = "VnetRoute"
            + next_hop_in_ip_address = ""
            + next_hop_type          = "VnetLocal"
          },
      ]
    + subnets                       = (known after apply)
  }

# module.vnet.module.subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureFirewallSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-firewall-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

# module.vnet.module.nat_gateway.module.public_ip["1"].azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-nat-gw-public-ip-1"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

  </details>